Repository: MikhailShishlyannikov/ToolStock
Catalog: Sam.ToolStock.Common/Resources/Resource.*.resx
Languages: ru

source: Back to main page
ru: Назад на главную страницу

# ChooseLang
source: Choose language
ru: Выберите язык

source: Entry
ru: Вход

source: Error of login
ru: Ошибка входа

source: Home Page
ru: Домашняя страница

source: Log In
ru: Войти

# LoginEmailIsNotValid
source: The E-mail field is not a valid e-mail address.
ru: Поле E-mail не является действительным адресом электронной почты.

# LoginInvalidEmailOrPassword
source: Invalid email or password.
ru: Неверный Email или пароль.

# LogInOrRegisterRequest
source: Please log in or register
ru: Пожалуйста, войдите или зарегистируйтесь

# LoginPasswordIsRequired
source: The Password field is required.
ru: Поле Пароль обязательно для заполнения.

source: Password
ru: Пароль

source: Register
ru: Зарегистрироваться

source: Confirm Password
ru: Подтвердите пароль

source: Name
ru: Имя

source: Patronymic
ru: Отчество

source: Phone
ru: Телефон

# RegisterNameIsRequired
source: The Name field is required.
ru: Поле Имя обязательно для заполнения.

source: Surname
ru: Фамилия

source: Your department
ru: Ваш отдел

# LoginEmailIsRequired
source: The E-mail field is required.
ru: Поле E-mail обязательно для заполнения.

# LoginMinLengthPassword
source: The length of 'Password' must be at least 6 characters.
ru: Длина пароля должна быть не менее 6 символов.

# RegisterConfirmPasswordEqualPassword
source: 'Confirm Password' must be equal to 'Password'.
ru: 'Подтвердите пароль' должно быть равно «Пароль».

# RegisterMaxLengthName
source: The length of 'Name' must be 60 characters or fewer.
ru: Длина имени должна быть не более 60 символов.

# RegisterMaxLengthPatronymic
source: The length of 'Patronymic' must be 70 characters or fewer.
ru: Длина отчества должна быть не более 70 символов.

# RegisterMaxLengthPhone
source: The length of 'Phone' must be 20 characters or fewer.
ru: Длина телефона должна быть не более 20 символов.

# RegisterMaxLengthSurname
source: The length of 'Surname' must be 80 characters or fewer.
ru: Длина фамилии должна быть не более 80 символов.

# RegisterSurnameIsRequired
source: The Surname field is required.
ru: Поле Фамилия обязательно для заполнения.

source: Menu
ru: Меню

source: All departments
ru: Все отделы

source: All stocks
ru: Все склады

# CreateDepartment
source: Create a department
ru: Создать отдел

# CreateStock
source: Create a stock
ru: Создать склад

source: Departments
ru: Отделы

source: Search
ru: Искать

source: Stocks
ru: Склады

source: Users
ru: Пользователи

# ChooseDepartment
source: Choose a department
ru: Выберите отдел

# ChooseStock
source: Choose a stock
ru: Выберите склад

source: Delete
ru: Удалить

source: Department
ru: Отдел

source: Disabled
ru: Отключен

source: Edit
ru: Редактировать

source: Full Name
ru: Ф.И.О.

# ModalPageMessageUpdate
source: The {0} {1} was updated successfully!
ru: {0} {1} успешно обновлен!

source: Reset
ru: Сброс

source: Return to
ru: Вернуться на

source: Role
ru: Роль

# ShowUserMenuTitle
source: <strong>Editing</strong> User
ru: <strong>Редактирование</strong> пользователя

source: Stock
ru: Склад

source: Update
ru: Обновить

source: User
ru: Пользователь

# UsersPage
source: the users page
ru: страницу пользователей

source: User Table
ru: Таблица пользователей

source: Actions
ru: Действия

source: all departments page
ru: страницу всех отделов

source: Create
ru: Создать

# CreateDepartmentPage
source: the create department page
ru: страницу создания отдела

# CreateNewDepartment
source: Create a new department
ru: Создать новый отдел

source: Deleted
ru: Удален

source: Department creating
ru: Создание отдела

source: Department reassigning
ru: Переназначение отдела

source: Department Table
ru: Таблица отделов

source: Logout
ru: Выйти

# ModalPageMessageCreate
source: The {0} "{1}" was created successfully!
ru: {0} "{1}" успешно создан!

# ModalPageMessageDelete
source: The {0}"{1}" was deleted successfully!
ru: {0} "{1}" успешно удален!

# ModalPageMessageRestore
source: The {0} "{1}" was restored successfully!
ru: {0} "{1}" успешно восстановлен!

source: My Profile
ru: Мой профиль

source: New department for stocks
ru: Новый отдел для складов

source: New department for users
ru: Новый отдел для пользователей

# ReassigningUsersAndStocksMessage
source: Reassigning Users and Stocks from <strong>the deleting department</strong>
ru: Переназначение пользователей и складов в <strong>в удаляемом отделе</strong>

source: Restore
ru: Восстановить

source: Settings
ru: Найстройки

source: Stock amount
ru: Количество отделов

source: Update department
ru: Обновление отдела

source: User amount
ru: Количество пользователей

# YouDidNotReassignStocks
source: You didn't reassign stocks
ru: Вы не переназначили склады

# YouDidNotReassignUsers
source: You didn't reassign users
ru: Вы не переназначили пользователей
